RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_i2c.c
/*!
    \brief      enable slave byte control (API_ID:0x0018U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_slave_byte_control_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_SBCTL;
    }
}

/*!
    \brief      disable slave byte control (API_ID:0x0019U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_slave_byte_control_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SBCTL;
    }
}

/*!
    \brief      generate a NACK in slave mode (API_ID:0x001AU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_nack_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) |= I2C_CTL1_NACKEN;
    }
}

/*!
    \brief      enable wakeup from deep-sleep mode (API_ID:0x001CU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_wakeup_from_deepsleep_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    I2C_CTL0(i2c_periph) |= I2C_CTL0_WUEN;
    }
}

/*!
    \brief      disable wakeup from deep-sleep mode (API_ID:0x001DU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_wakeup_from_deepsleep_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    I2C_CTL0(i2c_periph) &= ~I2C_CTL0_WUEN;
    }
}

/*!
    \brief      enable I2C (API_ID:0x001EU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_I2CEN;
    }
}

/*!
    \brief      disable I2C (API_ID:0x001FU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~I2C_CTL0_I2CEN;
    }
}

/*!
    \brief      generate a START condition on I2C bus (API_ID:0x0020U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_start_on_bus(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) |= I2C_CTL1_START;
    }
}

/*!
    \brief      generate a STOP condition on I2C bus (API_ID:0x0021U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_stop_on_bus(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) |= I2C_CTL1_STOP;
    }
}

/*!
    \brief      I2C transmit data (API_ID:0x0022U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  data: data to be transmitted
    \param[out] none
    \retval     none
*/
void i2c_data_transmit(uint32_t i2c_periph, uint32_t data)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TDATA(i2c_periph) = (I2C_TDATA_TDATA & data);
    }
}

/*!
    \brief      I2C receive data (API_ID:0x0023U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     uint32_t: 0x0-0xFF
*/
uint32_t i2c_data_receive(uint32_t i2c_periph)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = (I2C_RDATA(i2c_periph) & I2C_RDATA_RDATA);
    }
    return reval;
}

/*!
    \brief      enable I2C reload mode (API_ID:0x0024U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_reload_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) |= I2C_CTL1_RELOAD;
    }
}

/*!
    \brief      disable I2C reload mode (API_ID:0x0025U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_reload_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) &= ~I2C_CTL1_RELOAD;
    }
}

/*!
    \brief      configure number of bytes to be transferred (API_ID:0x0026U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  byte_number: 0x0-0xFF, number of bytes to be transferred
    \param[out] none
    \retval     none
*/
void i2c_transfer_byte_number_config(uint32_t i2c_periph, uint8_t byte_number)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) &= (uint32_t)(~I2C_CTL1_BYTENUM);
        I2C_CTL1(i2c_periph) |= (uint32_t)(((uint32_t)byte_number) << CTL1_BYTENUM_OFFSET);
    }
}

/*!
    \brief      enable I2C DMA for transmission or reception (API_ID:0x0027U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  dma: I2C DMA
                only one parameter can be selected which is shown as below:
      \arg        I2C_DMA_TRANSMIT: transmit data using DMA
      \arg        I2C_DMA_RECEIVE: receive data using DMA
    \param[out] none
    \retval     none
*/
void i2c_dma_enable(uint32_t i2c_periph, uint8_t dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else if(NOT_I2C_DMA(dma)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(I2C_DMA_TRANSMIT == dma) {
            I2C_CTL0(i2c_periph) |= I2C_CTL0_DENT;
        } else {
            I2C_CTL0(i2c_periph) |= I2C_CTL0_DENR;
        }
    }
}

/*!
    \brief      disable I2C DMA for transmission or reception (API_ID:0x0028U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  dma: I2C DMA
                only one parameter can be selected which is shown as below:
      \arg        I2C_DMA_TRANSMIT: transmit data using DMA
      \arg        I2C_DMA_RECEIVE: receive data using DMA
    \param[out] none
    \retval     none
*/
void i2c_dma_disable(uint32_t i2c_periph, uint8_t dma)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_I2C_DMA(dma)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(I2C_DMA_TRANSMIT == dma) {
            I2C_CTL0(i2c_periph) &= ~I2C_CTL0_DENT;
        } else {
            I2C_CTL0(i2c_periph) &= ~I2C_CTL0_DENR;
        }
    }
}

/*!
    \brief      I2C transfers PEC value (API_ID:0x0029U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_pec_transfer(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL1(i2c_periph) |= I2C_CTL1_PECTRANS;
    }
}

/*!
    \brief      enable I2C PEC calculation (API_ID:0x002AU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_pec_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_PECEN;
    }
}

/*!
    \brief      disable I2C PEC calculation (API_ID:0x002BU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_pec_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~I2C_CTL0_PECEN;
    }
}

/*!
    \brief      get packet error checking value (API_ID:0x002CU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     uint32_t: 0x0-0xFF
*/
uint32_t i2c_pec_value_get(uint32_t i2c_periph)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = (I2C_PEC(i2c_periph) & I2C_PEC_PECV);
    }
    return reval;
}

/*!
    \brief      enable SMBus alert (API_ID:0x002DU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_smbus_alert_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_SMBALTEN;
    }
}

/*!
    \brief      disable SMBus alert (API_ID:0x002EU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_smbus_alert_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SMBALTEN;
    }
}

/*!
    \brief      enable SMBus device default address (API_ID:0x002FU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_smbus_default_addr_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_SMBDAEN;
    }
}

/*!
    \brief      disable SMBus device default address (API_ID:0x0030U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_smbus_default_addr_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SMBDAEN;
    }
}

/*!
    \brief      enable SMBus host address (API_ID:0x0031U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_smbus_host_addr_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= I2C_CTL0_SMBHAEN;
    }
}

/*!
    \brief      disable SMBus host address (API_ID:0x0032U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_smbus_host_addr_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SMBHAEN;
    }
}

/*!
    \brief      enable extended clock timeout detection (API_ID:0x0033U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_extented_clock_timeout_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) |= I2C_TIMEOUT_EXTOEN;
    }
}

/*!
    \brief      disable extended clock timeout detection (API_ID:0x0034U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_extented_clock_timeout_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_EXTOEN;
    }
}

/*!
    \brief      enable clock timeout detection (API_ID:0x0035U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_clock_timeout_enable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) |= I2C_TIMEOUT_TOEN;
    }
}

/*!
    \brief      disable clock timeout detection (API_ID:0x0036U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void i2c_clock_timeout_disable(uint32_t i2c_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_TOEN;
    }
}

/*!
    \brief      configure bus timeout B (API_ID:0x0037U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  timeout: bus timeout B
    \param[out] none
    \retval     none
*/
void i2c_bus_timeout_b_config(uint32_t i2c_periph, uint32_t timeout)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else if(NOT_I2C_TIMEOUT(timeout)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0037U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_BUSTOB;
        I2C_TIMEOUT(i2c_periph) |= (uint32_t)(timeout << TIMEOUT_BUSTOB_OFFSET);
    }
}

/*!
    \brief      configure bus timeout A (API_ID:0x0038U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  timeout: bus timeout A
    \param[out] none
    \retval     none
*/
void i2c_bus_timeout_a_config(uint32_t i2c_periph, uint32_t timeout)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else if(NOT_I2C_TIMEOUT(timeout)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0038U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_BUSTOA;
        I2C_TIMEOUT(i2c_periph) |= timeout;
    }
}

/*!
    \brief      configure idle clock timeout detection (API_ID:0x0039U)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  timeout: bus timeout A
      \arg        BUSTOA_DETECT_SCL_LOW: BUSTOA is used to detect SCL low timeout
      \arg        BUSTOA_DETECT_IDLE: BUSTOA is used to detect both SCL and SDA high timeout when the bus is idle
    \param[out] none
    \retval     none
*/
void i2c_idle_clock_timeout_config(uint32_t i2c_periph, uint32_t timeout)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else if(NOT_I2C_TIMEOUT_DET(timeout)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_TOIDLE;
        I2C_TIMEOUT(i2c_periph) |= timeout;
    }
}

/*!
    \brief      get I2C flag status (API_ID:0x003AU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  flag: I2C flags
                only one parameter can be selected which is shown as below:
      \arg        I2C_FLAG_TBE: I2C_TDATA is empty during transmitting
      \arg        I2C_FLAG_TI: transmit interrupt
      \arg        I2C_FLAG_RBNE: I2C_RDATA is not empty during receiving
      \arg        I2C_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_FLAG_NACK: not acknowledge flag
      \arg        I2C_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_FLAG_TC: transfer complete in master mode
      \arg        I2C_FLAG_TCR: transfer complete reload
      \arg        I2C_FLAG_BERR: bus error
      \arg        I2C_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_FLAG_PECERR: PEC error
      \arg        I2C_FLAG_TIMEOUT: timeout flag
      \arg        I2C_FLAG_SMBALT: SMBus alert
      \arg        I2C_FLAG_I2CBSY: busy flag
      \arg        I2C_FLAG_TR: whether the I2C is a transmitter or a receiver in slave mode
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_flag_get(uint32_t i2c_periph, uint32_t flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else if(NOT_I2C_STAT_FALG(flag)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(RESET != (I2C_STAT(i2c_periph) & flag)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear I2C flag status (API_ID:0x003BU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  flag: I2C flags
                only one parameter can be selected which is shown as below:
      \arg        I2C_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_FLAG_NACK: not acknowledge flag
      \arg        I2C_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_FLAG_BERR: bus error
      \arg        I2C_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_FLAG_PECERR: PEC error
      \arg        I2C_FLAG_TIMEOUT: timeout flag
      \arg        I2C_FLAG_SMBALT: SMBus Alert
    \param[out] none
    \retval     none
*/
void i2c_flag_clear(uint32_t i2c_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else if(NOT_I2C_STAT_CLEAR_FALG(flag)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_STATC(i2c_periph) |= flag;
    }
}

/*!
    \brief      enable I2C interrupt (API_ID:0x003CU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  interrupt: I2C interrupts
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_ERR: error interrupt
      \arg        I2C_INT_TC: transfer complete interrupt
      \arg        I2C_INT_STPDET: stop detection interrupt
      \arg        I2C_INT_NACK: not acknowledge received interrupt
      \arg        I2C_INT_ADDM: address match interrupt
      \arg        I2C_INT_RBNE: receive interrupt
      \arg        I2C_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_interrupt_enable(uint32_t i2c_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else if(NOT_I2C_INT(interrupt)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) |= interrupt;
    }
}

/*!
    \brief      disable I2C interrupt (API_ID:0x003DU)
    \param[in]  i2c_periph: I2Cx(x=0,1,2,3)
    \param[in]  interrupt: I2C interrupts
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_ERR: error interrupt
      \arg        I2C_INT_TC: transfer complete interrupt
      \arg        I2C_INT_STPDET: stop detection interrupt
      \arg        I2C_INT_NACK: not acknowledge received interrupt
      \arg        I2C_INT_ADDM: address match interrupt
      \arg        I2C_INT_RBNE: receive interrupt
      \arg        I2C_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_interrupt_disable(uint32_t i2c_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else if(NOT_I2C_INT(interrupt)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_CTL0(i2c_periph) &= ~interrupt;
    }
}

